from random import *

word_list = ['Москва', 'Рязань', 'Можайск', 'Омск', 'Владимир', 'Тверь', 'Углич', 'Тула', 'Руза', 'Воркута', 'Мурманск', 'Киров', 'Иркутск', 'Якутск', 'Красноярск', 'Хабаровск', 'Новосибирск']

#функция получения случайного слова
def get_word(arr):
    return choice(arr)

def display_hangman(tries):
    stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
                '''
                    --------
                    |      |
                    |      O
                    |     \\|/
                    |      |
                    |     / \\
                    -
                ''',
                # голова, торс, обе руки, одна нога
                '''
                    --------
                    |      |
                    |      O
                    |     \\|/
                    |      |
                    |     / 
                    -
                ''',
                # голова, торс, обе руки
                '''
                    --------
                    |      |
                    |      O
                    |     \\|/
                    |      |
                    |      
                    -
                ''',
                # голова, торс и одна рука
                '''
                    --------
                    |      |
                    |      O
                    |     \\|
                    |      |
                    |     
                    -
                ''',
                # голова и торс
                '''
                    --------
                    |      |
                    |      O
                    |      |
                    |      |
                    |     
                    -
                ''',
                # голова
                '''
                    --------
                    |      |
                    |      O
                    |    
                    |      
                    |     
                    -
                ''',
                # начальное состояние
                '''
                    --------
                    |      |
                    |      
                    |    
                    |      
                    |     
                    -
                '''
    ]
    return stages[tries]
    
